# Вызов библиотеки матанализа
import math

y = math.sin(x)
print(math.sin(math.pi/2))


# Использование функции из библиотеки math

from math import*

y = sin(x)
print(sin(pi/2))



# Дано положительное действительное число X. Выведите его дробную часть.
import math

x = float(input())
print(x-int(x))


# Ввод 17.9 ответ 0.899999999986